Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G16.tmx
Source language: en_us
Languages: zh_cn

source: Edward Kennedy
zh_cn: 一代政坛豪门的谢幕－爱德华·肯尼迪逝世

source: Edward Kennedy - the last survivor of the three Kennedy brothers who left an indelible political mark on their age - has died at the age of 77.
zh_cn: 爱德华·肯尼迪（Edward Kennedy） ——肯尼迪三兄弟中的硕果仅存者与世长辞，享年77岁。肯尼迪三兄弟都在各自的人生中留下了不可磨灭的政治烙印。

source: Though the manifest flaws in his character cost him the American presidency in 1980, time and circumstance ensured that his eventual contribution to his compatriots' welfare could well prove to be his enduring legacy, eclipsing the memory of his turbulent private life and the scandal surrounding the death of Mary Jo Kopechne at Chappaquiddick in 1969.
zh_cn: 虽然参议员肯尼迪性格上明显的瑕疵让他错失1980年的总统宝座，但时间和事实证明他最终为国人的幸福所作出的贡献会流芳百世。关于他不安定的私生活以及1969年在查帕奎迪克岛导致一位名叫玛丽·乔·科佩奇尼(Mary Jo Kopechne)的女孩死亡的丑闻，都将瑕不掩瑜。

source: His death marks the end of five decades in which the brothers had symbolised the progressive impulses of the Democratic party.
zh_cn: 50年来，肯尼迪兄弟是民主党进步力量的象征，爱德华·肯尼迪的离去标志着肯尼迪时代的终结。

source: He was first elected to Congress by Massachusetts voters in 1962, and eventually achieved the second-longest Senate term in US history.
zh_cn: 1962年，爱德华·肯尼迪被马萨诸塞州的选民推选为国会议员，并最终成为美国历史上任期时间第二长的议员。

source: This enabled him to create an unrivalled legislative record, dealing with such concerns as healthcare, education and training, safety at work and a wide range of other social concerns.
zh_cn: 这使他有能力创下一个无人能及的立法记录，处理了诸如医疗保健、教育培训、工作安全以及其他受社会广泛关注的问题。

source: His remarkable capacity for work and his pragmatism in securing a consensus among his colleagues won him wide respect from both parties.
zh_cn: 他非凡的工作能力和确保在同僚中达成共识的实用主义思想，赢得两党议员的广泛尊敬。

source: In May 2008 Kennedy collapsed at his home and was found to have a malignant brain tumour.
zh_cn: 2008年5月，他在家中晕倒，之后被查出患有恶性脑瘤。

source: He underwent immediate surgery, followed by radiation treatment and chemotherapy.
zh_cn: 他接受了紧急手术，随后又进行放疗和化疗。

source: To the astonishment of delegates, he made an appearance at the Democratic convention in Denver, Colorado, in August to express his strong support for Barack Obama as the party's presidential nominee, having endorsed his candidacy the previous January at a crucial stage in the campaign.
zh_cn: 2008年8月，令参会代表们惊讶不已的是，他出席了在科罗拉多州丹佛市举行的民主党全国代表大会，对奥巴马作为民主党总统候选人表示强烈支持。去年1月，在总统竞选的关键阶段，肯尼迪对奥巴马的候选人资格予以了支持。

source: With the scar from his surgery clearly evident, and with many delegates in tears, Kennedy mounted the podium to produce an echo of the remarkable speech he had made at the 1980 New York convention, when his campaign against President Jimmy Carter for the Democratic nomination collapsed.
zh_cn: 带着外科手术留下的清晰疤痕，在许多代表的含泪注目下，肯尼迪登上演讲台发表了一次杰出的演讲，他的声音回荡在会场上。在民主党1980年的纽约大会上，他也曾作过这样的演讲，当时他与总统吉米·卡特竞争总统候选人的战役以失败告终。

source: In a strong voice, he told the audience in Denver that "this November, the torch will be passed to a new generation of Americans.
zh_cn: 这一次，他用铿锵有力的声音告诉丹佛的听众，“今年10月，火炬将传递到新一代美国人手中。

source: The work begins anew, the hope rises again and the dream lives on."
zh_cn: 使命重新开启，希望再次点燃，梦想仍在延续！”

source: It was a tacit acknowledgment that his own part in the process was drawing to a close.
zh_cn: 然而，大家心里都清楚，在这条路上，他的使命正接近尾声。

source: Edward Moore Kennedy, widely known as Ted, was the youngest of Joseph and Rose Kennedy's nine children, a factor that was important in the development of his complex and contradictory personality.
zh_cn: 爱德华·穆尔·肯尼迪是约瑟夫·肯尼迪和罗斯·肯尼迪夫妇9个孩子中最小的一个，这个因素对他复杂和矛盾个性的形成起到关键作用。

source: At his birth, his nearest sibling, Jean, was four and his eldest brother, Joseph, was nearly 17.
zh_cn: 他出生时，和他年龄最近的姐姐简（Jean）4岁，而他的大哥约瑟夫已经快17岁了。

source: The boy turned out to be a good-natured child who, with the increasing absence of his father and brothers, was treated with the utmost indulgence by his mother and sisters.
zh_cn: 爱德华是一个本性善良的孩子，然而父亲和哥哥们越来越多的时候都不在他身边，母亲和姐姐们对这个小男孩极度溺爱。

source: He commented in later life that those early years had passed "having a whole army of mothers around me".
zh_cn: 他在晚年评价他的早年生活时，称“有一个母亲团围绕着我。”

source: When he was six, his father's appointment as ambassador to Britain brought a traumatic change to this secure and sheltered domestic scene.
zh_cn: 六岁时，他的父亲被任命为驻英国大使，由此彻底改变了他安定的、受庇护的家庭生活。

source: After the move to London, the child never seemed to be allowed to establish himself anywhere.
zh_cn: 搬到伦敦后，这个孩子似乎从未让自己安顿下来。

source: By the end of the second world war, when he was 13, he had attended 10 different schools.
zh_cn: 到二战结束时，13岁的爱德华已经换了10所学校。

source: He privately acknowledged that the emotional effect of this disruption was to leave him with virtually no recollection of his life between the ages of seven and 18.
zh_cn: 他私下里承认，受这种混乱情绪的影响，他几乎不记得7岁至18岁之间的生活。

source: His aviator brother Joe was killed in action in France in 1944, and Edward became increasingly conscious of the heightened expectations his parents had of their remaining sons.
zh_cn: 1944年，他的飞行员哥哥乔在法国的战斗中牺牲。年轻的“泰迪”（爱德华的昵称）开始越来越强烈的意识到，他的父母对余下的儿子们有越来越高的期望。

source: The family's history since it fled the Irish famine in 1848 had been one of relentless material and political advance.
zh_cn: 从1848年逃避爱尔兰饥荒而开始的家族历史充满冷酷的财富和政治的优势。

source: Grandfather Patrick Kennedy, a Boston saloon keeper, had been elected to the Massachusetts state legislature at the early age of 27.
zh_cn: 祖父帕特里克·肯尼迪（Patrick Kennedy）是波士顿的一个酒吧老板，在27岁的时候被选入马萨诸萨州立法机构任职。

source: From that vantage point, he shrewdly harnessed his new influence in the struggle against the dominant Yankee establishment.
zh_cn: 他机敏地利用了这一任职优势，在和那些美国大家族企业的斗争中施加自己的影响力。

source: His mastery of wheeling and dealing soon gave him political control of the impoverished Irish area of east Boston.
zh_cn: 他左右逢源的技巧使他不久获得了东波士顿贫困的爱尔兰居住区的政治控制权。

source: With the power to deliver the voters of this fiefdom to Boston's Democratic party machine, Patrick's advance was spectacular.
zh_cn: 凭借着对波士顿地区选民的影响力，帕特里克的人气大大提升。

source: He became a state senator and then moved into a variety of appointed offices in the city at what was then the enormous salary of $5,000 a year.
zh_cn: 他成为了州议员，在市政府多种机构任职，并且获得了每年5000美金的丰厚薪水。

source: From there he advanced steadily up the party ladder and was soon accepted as one of Boston's most powerful figures.
zh_cn: 从那时起，帕特里克开始稳稳地顺着民主党阶梯向上爬，很快就成为波士顿地区最有权威的人士之一。

source: Within a decade, using bribery, dead men's votes, intimidation and any other weapon that came to hand, the Irish factions gained control of Boston.
zh_cn: 在十年之内，通过贿赂、虚假投票、恐吓和其他手段，爱尔兰人派系获得了波士顿的控制权。

source: They have never lost it.
zh_cn: 而且他们再也没有丢失过对这一城市的控制。

source: In spite of this political success, Patrick realised that a social gulf remained.
zh_cn: 尽管在政治上获得了成功，帕特里克认识到社会地位仍然没有变化。

source: He decided to send his son Joseph - Edward's father - to the Boston Latin school, attended by most of the children of the city's elite families.
zh_cn: 他决定将他的儿子约瑟夫——也即爱德华·肯尼迪的父亲——送到波士顿一所上层社会子女就读的拉丁学校。

source: Young Joseph was not academically successful there, but his talent as a baseball player led to a number of useful friendships.
zh_cn: 年轻的约瑟夫在那里学业无成，但是作为棒球好手，他在校园里结交了很多有用的朋友。

source: When his attempt to replicate this process at Harvard University failed, his father used his political clout by securing him a place in the college basketball team.
zh_cn: 当他企图在哈佛大学也能如高中一样鬼混却未能如愿后，他的父亲运用其巨大的政治影响力，为他的儿子在大学棒球队中保住了一个位置。

source: The pattern of the Kennedy clan had thus been established - to win any struggle it undertook without bothering too much about the means.
zh_cn: 肯尼迪家族的模式至此建立，就是“不择手段，达到目的”。这一模式在约瑟夫·肯尼迪时代发挥得淋漓尽致。

source: This pattern was heightened when Joseph Kennedy, in a series of extremely risky deals, bludgeoned his way into the tightly controlled Boston banking community and then, as a figure of growing consequence, married Rose Fitzgerald, the mayor of Boston's daughter.
zh_cn: 他通过一系列极具风险的交易，强行挤入控制森严的波士顿银行业，成为议员，并且作为风头人物迎娶了波士顿市长的女儿罗丝·菲茨杰拉尔德。

source: His bride was as steeped in local politics as her new husband, having often acted as her father's hostess and grown accustomed to the pressures and accommodations his position entailed.
zh_cn: 罗丝和爱德华一样，是本地政坛的一号人物，常常代表她的父亲做东道，逐渐习惯了他这个位置所承受的压力和责任。

source: This was the atmosphere in which their rapidly growing family was raised.
zh_cn: 他们正是在这一氛围中长大的。

source: Both parents stressed to their children the importance of winning. Merely to try their best was not enough.
zh_cn: 两方的父母都灌输他们的子女胜利有多么的重要：仅仅靠自身的努力是不够的。

source: It was an affluent life, though the source of Joseph's fortune has never been wholly clear.
zh_cn: 约瑟夫一生富足，尽管其财富来得并非全部清白。

source: While some of it was acquired through bootlegging during prohibition in the 1930s, other elements came more legitimately from the film industry and complex stock market manipulations.
zh_cn: 其中一部分来自于30年代禁酒令期间的非法贩卖私酒，另一部分来自于投资合法的电影工业，还有就是操控股票市场所得。

source: It meant the family was never concerned about its material wellbeing.
zh_cn: 这个家族从来没有担心过他们的物资财富。

source: It had three large homes and the children benefited from trust funds established by their father that would reach $10m apiece in his lifetime.
zh_cn: 他们有3个大宅，孩子由父辈建立的信托基金中受益，每人一生中所得可达到1000万美元。

source: This wealth also enabled Joseph to buy as much political influence from the Franklin Delano Roosevelt administration as he wanted (including the London ambassadorship).
zh_cn: 这笔财富同样使得约瑟夫能从富兰克林·德拉诺·罗斯福政府那里买到他所想要的政治影响力（包括伦敦大使的职位）。

source: The effect on his youngest son of growing up in this amoral climate soon became apparent.
zh_cn: 这种非道德环境对他最小儿子的成长影响不久显现了出来。

source: Like his brothers, Edward had inherited his father's sporting prowess.
zh_cn: 像他的兄长一样，爱德华继承了他父亲的体育天赋。

source: By the time he began at Harvard in 1950, he was more than six feet tall, weighed 15 stone and had become a notable player of American football.
zh_cn: 到1950年开始在哈佛就学时，他身高6英尺多，体重超过 15 英石（英国重量单位，相当于 6.35 千克或 14 磅），而且成为了一个引人注目的美式橄榄球运动员。

source: He was keen to join the university team but was hampered by a poor record in his studies.
zh_cn: 他非常想加入校队，但是由于课程成绩糟糕遭受挫折。

source: Unlike other US universities, Harvard made sporting advancement dependent on a sound academic performance.
zh_cn: 与美国其他大学不同，晋升哈佛校队要有出色的学习成绩。

source: Faced with a Spanish examination he was sure he would fail, Kennedy paid a more adept friend to take it for him.
zh_cn: 面对一次他确信自己肯定考不过的西班牙语考试，他花钱让一个成绩出色的朋友代考。

source: To the chagrin of his family, the plot was discovered and he was expelled, though the incident was covered up for more than a decade.
zh_cn: 然而令其家族感到愤怒的是，事情最终败露，他被学校除名，尽管事后该事件被成功地掩盖了10多年。

source: With his exemption from military service now void, he was conscripted into the army from 1951 to 1953.
zh_cn: 随着免兵役期的失效，爱德华在1951到1953年期间应征入伍。

source: The family appeared to regard his brief service career as a form of punishment and made no effort to ease his lot.
zh_cn: 家族显然认为短暂军旅生涯是对他的某种惩罚，因此并没有花力气让他过得舒服些。

source: He never got beyond the rank of private and in his biographical listings, that period was dismissed in four words.
zh_cn: 他从未能超过二等兵军衔，在他的自传里这段时期只用了4个词一笔带过。

source: There was, however, clearly considerable negotiation going on behind the scenes, because he was allowed to return to Harvard after his military discharge.
zh_cn: 他服满兵役后又回到了哈佛，这背后显然有什么大交易。

source: Possibly as a reaction to military discipline, his increasingly erratic temperament began to emerge.
zh_cn: 也许是对军队纪律的某种反应，爱德华那愈发难以捉摸的脾气开始显现了出来。

source: To the horror of his team-mates in a football match against a side from New York, he was sent off after three times starting fights on the field.
zh_cn: 在和一支纽约球队的比赛中，他的行为令队友感到恐惧：在场内3次挑起争斗后，他被裁判驱逐出场。

source: He did not like being bested.
zh_cn: 他不喜欢被打败。

source: Although he got a BA in government at Harvard (1956), he failed to qualify for its law school and enrolled instead at that of the University of Virginia.
zh_cn: 尽管他在哈佛获得了政务学学士学位（1956），但是他没能从哈佛法学院毕业，转而进入佛吉尼亚大学法学院。

source: He again jeopardised his career there with a series of motoring offences, including jumping a red light on a suburban street at 90mph.
zh_cn: 他的生涯因一系列违规驾驶而再次危机重重，包括以每小时90英里（约合145公里）的速度在市郊闯红灯。

source: However, he graduated as a bachelor of law in 1959 and was immediately admitted to the Massachusetts bar.
zh_cn: 但他还是在1956年获法学学士学位，随即就取得了马塞诸塞律师从业资格。

source: Just before graduation he had met and married Joan Bennett, but even with a wife to support, he was hardly in need of a paying job.
zh_cn: 贝内特（Joan Bennet）并结婚。尽管要养家糊口，但爱德华并不需要为此去找一份工作。

source: Kennedy had started to benefit from his father's trust fund and, having acted as manager of his older brother John's 1958 Senate re-election campaign, was now recruited for the next stage of the family's grand plan, John's bid for the White House.
zh_cn: 他已经开始受惠于其父亲的信托基金。在担任了其大哥约翰1958年参议员改选的竞选经理之后，他加入了家族团队，为约翰入主白宫的宏伟目标努力。

source: For the most part he was sent to work in the western states, most of them hopeless prospects with a long history of voting Republican.
zh_cn: 多数情况下，他被派往没有希望的西部各州，这些地方素来是共和党的票仓。

source: It fell to his brother Robert to control the central campaign, in which John scraped into the White House in 1960 as the country's first Roman Catholic president by a margin of 113,000 votes out of 69m.
zh_cn: 他的哥哥罗伯特挑起了对竞选进行运筹帷幄的重担。1960年，约翰·肯尼迪以极其微弱的优势——在6900万张选票中仅胜出11.3万张——入住白宫，成为美国历史上第一个天主教总统。

source: His victory was subsequently attributed to large-scale ballot rigging by the Chicago mayor Richard Daley's Irish-run administration.
zh_cn: 人们常常把他的获胜归结于芝加哥的爱尔兰裔市长理查德·戴利在选举中搞的大规模舞弊。

source: The episode starkly underlined an adage of Thomas "Tip" O'Neill, one of the Kennedy family's closest allies in Boston and later speaker of the House of Representatives.
zh_cn: 这印证了托马斯·奥尼尔——肯尼迪家族在波士顿地区最紧密的盟友，后来的白宫发言人——的名言。

source: In the end, he declared, all politics was local.
zh_cn: 他宣称，一切政治家都是乡土的。

source: It was a lesson Edward Kennedy absorbed, and would underpin his entire political career.
zh_cn: 这也正是爱德华·肯尼迪从中领悟到的，并贯穿于其一生的政治生涯。

source: With John as president (and Robert his attorney general), the Massachusetts Senate seat fell vacant, but Edward was still two years below the minimum legal age to take over.
zh_cn: 随着约翰·肯尼迪当选为总统，而罗伯特为他的司法部长，马萨诸塞州参议员的席位空了出来。但爱德华还差两年才到能够接手的法定年龄。

source: So it was held by a nominee until the Kennedys could reclaim it in the 1962 election.
zh_cn: 因此，这一席位被他人占据，直到 1962年才重新回到爱德华家族的手中。

source: Edward won the remainder of John's term by an overwhelming majority, partly through crude hints that the family would now be able to shower the state with federal largesse.
zh_cn: 在选举中，爱德华以压倒性优势赢取了约翰剩下的任期，部分原因是他向人们暗示，肯尼迪兄弟有可能把联邦的慷慨普施到马萨诸塞州。

source: A year later JFK was assassinated.
zh_cn: 一年后，约翰·肯尼迪遇刺。

source: Edward was in the Senate chamber when the news was brought to him.
zh_cn: 消息传到爱德华耳里的时候，他正在参议员的办公室里。

source: He gathered his papers silently and left the chamber to discover more.
zh_cn: 他默默地收拾起文件，离开办公室，去打探更多的消息。

source: But the Washington telephone system had collapsed under the weight of calls, and he arrived at the family home in Hyannis still unclear about the precise circumstances of his brother's death.
zh_cn: 不过当时，华盛顿的电话系统不堪重负而崩溃。因此，当爱德华回到海厄尼斯（Hyannis）的家中时，对于兄长遇刺的具体情况仍然不是很清楚。

source: His father was by now frail and bedridden and it fell to Edward and his sister Eunice to break the news to him the following morning.
zh_cn: 他父亲年老体衰，卧床不起。因此直到第二天早上，才由爱德华和他胞妹尤尼斯将约翰遇刺的消息告知他。

source: In the private turmoil that followed the murder, the senator's public life had to continue.
zh_cn: 谋杀给爱德华的私人生活带来了巨大的扰动，但他的公众生活还得继续。

source: He was obliged to fight once more for his newly won seat because its six-year term had expired.
zh_cn: 他不得不为他刚刚赢到手的参议员座席再次打拼，因为六年的任期已经满了。

source: While criss-crossing the state to gather support, his private plane crashed.
zh_cn: 在州内巡回演讲寻求支持时，他的私人座机坠毁了。

source: Kennedy was the only passenger who had not fastened his seat belt, and he sustained six spinal fractures and two broken ribs.
zh_cn: 爱德华是机上唯一未系安全带的乘客，这导致他六处脊柱受伤，两处肋骨骨折。

source: He spent six months in hospital and never wholly shook off the effects of the injuries.
zh_cn: 他在医院里躺了六个月，这次受伤造成的影响伴随了他一生。

source: But the combination of Kennedy money and widespread sympathy for the family ensured an easy victory, and his political career hit its stride.
zh_cn: 但是，肯尼迪家族的财富以及所受到的广泛同情确保了爱德华轻松地获胜，他的政治生涯也大大跨进了一步。

source: There was, of course, considerable hostility between the remaining brothers and President Lyndon Johnson, and the vehicle for its expression became the Vietnam war.
zh_cn: 罗伯特与爱德华兄弟与当时的总统林登·约翰逊之间存在很大敌意，集中表现在随后爆发的越南战争上。

source: Edward joined with Robert - who had secured one of New York's Senate seats in the 1964 election - to focus the country's increasing disenchantment with the conflict.
zh_cn: 罗伯特在1964年的选举中确保了其纽约州参议员的席位。之后，爱德华与兄长一道， 唤起国内对越战的觉醒。

source: As American troops became mired more deeply, Robert announced he would fight Johnson for the 1968 Democratic presidential nomination.
zh_cn: 随着美国军队越陷越深，罗伯特宣布他将与约翰逊竞争1968年民主党的总统提名。

source: Within days, the president withdrew from the contest and Robert looked certain to be the party's candidate.
zh_cn: 几天后，约翰逊退出竞争，罗伯特似乎稳稳地成为了民主党的候选人。

source: He had just won his sixth primary, in California, when he, too, was assassinated.
zh_cn: 然而，就在罗伯特在加州刚刚赢得了第六场预选赛的胜利时，他也遇刺了。

source: It had a cataclysmic effect on Edward, now the only remaining brother.
zh_cn: 这对三兄弟中的仅存者爱德华来说无异于惊天巨变。

source: At the funeral he gave a short, spontaneous address which many felt was the most moving speech of his life.
zh_cn: 在葬礼上他发表了一次简短、自然的演说，许多人感到从未听过如此动人的话语。
